# 집합 심화

# ===========================================================
#  집합에서 제공하는 메소드
# ===========================================================

# 집합 연산 (합집합, 교집합, 차집합)
a = {1, 2, 3, 4}
b = {3, 4, 5, 6}

# 합집합
print(a.union)                    # {1, 2, 3, 4, 5, 6}
print(a | b)

# 교집합
print(a.intersection(b))                    # {3, 4}
print(a & b)

# 차집합
print(a.difference(b))                    # {1, 2}
print(a - b)
print(b.difference(a))                    # {1, 2}
print(b - a)
                    # {5, 6}

# 대칭 차집합 : 한쪽에만 있는 항목
print(a.symmetric_difference(b))
print(a ^ b)                   # {1, 2, 5, 6}


# 부분집합
x = {1, 2}
y = {1, 2, 3, 4}

print(x.issubset(y))            # 부분집합
print(y.issuperset(x))          # 상위집합

# ===========================================================
#  그 외
# ===========================================================

# 집합 언패킹
s = {100, 10, 30, 5, 5, 5}
print(*s)

# set -> list, tuple
a, *b, c = s
print(list(s))
print(list(s))

# list, tuple -> set
a = [1, 2, 2, 3, 3, 3]
b = (3, 3, 4, 4, 4, 5)

print(set(a))
print(set(b))

# =========================================================
#  🔥 실습 문제
# =========================================================

# 수업을 듣는 학생 명단
python_class = {"김철수", "이영희", "박민수"}
c_class = {"이영희", "최지훈", "박민수"}

# 1️⃣ 두 수업 다 듣는 학생 출력하기
print(python_class & c_class)
                                        # ✅ {'이영희', '박민수'}


# 2️⃣ Python만 듣는 학생 출력하기
print(python_class - c_class)
                                        # ✅ {'김철수'}


# 3️⃣ 둘 중 하나라도 듣는 학생 출력하기
print(python_class | c_class)
                                        # ✅ {'최지훈', '김철수', '이영희', '박민수'}